<?php

$string['pluginname'] = 'Блок Надо проверить';
$string['need_to_check'] = 'Надо проверить';
$string['need_to_check:addinstance'] = 'Добавить новый блок Надо проверить';
$string['need_to_check:myaddinstance'] = 'Добавить новый блок Надо проверить на личную страницу';
$string['not_assigned'] = 'Не назначен';
$string['works_for_teachers'] = 'Работы для преподавателей';
$string['my_works'] = 'Мои работы';
$string['time_for_check_work'] = 'Время, через которое проверка работы будет считаться просроченной (timestamp)';
$string['time_for_check_work_desc'] = 'После истечения времени проверки, непроверенная работа будет считаться просроченной и отображаться красным цветом.<br>Формат времени timestamp.<br>Значение по умолчанию 518400 (6 дней).';
$string['go_to_course'] = 'перейти к курсу';
$string['update_teacher_table'] = 'Обновить базу данных блока';
$string['update_teacher_table_title'] = 'Обновление базы данных блока необходимо для корректной работы.&#013;&#013;Обновление базы данных нужно выполнять после изменения состава учителей, проверяющих работы студентов.&#013;&#013;Преподаватель считается проверяющим, если он зачислен в ту же группу, что и студент, а также имеет роль на основе архетипа teacher или editingteacher в соответствующей активности или курсе.&#013;&#013;Этот блок использует базу данных для повышения скорости своей работы.';
$string['table_updated'] = 'Таблица блока обновлена в базе данных.';


