<?php

$string['pluginname'] = 'Блок Трэба праверыць';
$string['need_to_check'] = 'Трэба праверыць';
$string['need_to_check:addinstance'] = 'Дадаць новы блок Трэба праверыць';
$string['need_to_check:myaddinstance'] = 'Дадаць новы блок Трэба праверыць на асабістую старонку';
$string['not_assigned'] = 'Не прызначаны';
$string['works_for_teachers'] = 'Работы для настаўнікаў';
$string['my_works'] = 'Мае работы';
$string['time_for_check_work'] = 'Час, праз які праверка работы будзе лічыцца пратэрмінаванай (timestamp)';
$string['time_for_check_work_desc'] = 'Пасля заканчэння часу праверкі, неправераная праца будзе лічыцца пратэрмінаванай і адлюстроўвацца чырвоным колерам.<br>Фармат часу timestamp.<br>Значэнне па змаўчанні 518400 (6 дзён).';
$string['go_to_course'] = 'перайсці да курса';
$string['update_teacher_table'] = 'Абнавіць базу дадзеных блока';
$string['update_teacher_table_title'] = 'Абнаўленне базы дадзеных блока патрэбна для карэктнай працы.&#013;&#013;Абнаўленне базы дадзеных трэба выконваць пасля змены складу настаўнікаў, якія правяраюць работы студэнтаў.&#013;&#013;Настаўнік лічыцца правяральнікам, калі ён залічаны ў тую ж групу, што і студэнт, а таксама мае ролю на грунце архетыпа teacher ці editingteacher у адпаведнай актыўнасці або курсе.&#013;&#013;Гэты блок выкарыстоўвае базу дадзеных для павышэння хуткасці сваёй працы.';
$string['table_updated'] = 'Табліца блока абноўлена ў базе дадзеных.';



